tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Terminal multiplexer
brew "tmux"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Server and cloud storage browser
cask "cyberduck"
# GIT client
cask "fork"
# Free and open-source image editor
cask "gimp"
# Collaboration platform for API development
cask "postman"
# Virtual machines UI using QEMU
cask "utm"
