tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# Modern replacement for 'ls'
brew "exa"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Menu bar icon organizer
cask "bartender"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# HTTP and GraphQL Client
cask "insomnia"
# Cross-platform MQTT 5.0 Desktop Client
cask "mqttx"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "christian-kohler.npm-intellisense"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "formulahendry.code-runner"
vscode "GitHub.github-vscode-theme"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "PKief.material-icon-theme"
vscode "redhat.java"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
