amd-ucode
arandr
arc-gtk-theme
autorandr
base
base-devel
bat
beekeeper-studio-bin
blueman
bluez
breeze-gtk
brightnessctl
caffeine-ng
capitaine-cursors
composer
ddcui
ddcutil
dmenu
efibootmgr
feh
firefox-developer-edition
flameshot
fontforge
fzf
git
git-delta
github-cli
gitui
google-chrome
grub
gst-plugin-pipewire
htop
i3-wm
i3lock
i3status
intel-media-driver
iwd
jetbrains-toolbox
kitty
less
libpulse
libreoffice-fresh
libva-intel-driver
libva-mesa-driver
lightdm
lightdm-gtk-greeter
linux
linux-firmware
lxappearance
mailpit
materia-gtk-theme
minio
nano
neovim
network-manager-applet
networkmanager
nordic-theme
noto-fonts-cjk
noto-fonts-emoji
openssh
papirus-icon-theme
php
php-gd
php-pgsql
php-redis
php-sqlite
picom
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
postgresql
redis
rofi
slack-desktop
smartmontools
sof-firmware
spotify
telegram-desktop
thunar
thunderbird
tlp
tmux
unzip
vim
vulkan-intel
vulkan-radeon
wget
wireless_tools
wireplumber
xcursor-comix
xdebug
xdg-utils
xf86-video-amdgpu
xf86-video-ati
xf86-video-nouveau
xf86-video-vmware
xfce4-power-manager
xfce4-screensaver
xorg-xinit
xterm
yay
yay-debug
zram-generator
zsh
